Revit 2026 API

# IFCAnyHandleUnsetAttribute Method

---

Unsets the attribute value.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void UnsetAttribute(
	string name
)
```
```vb
Public Sub UnsetAttribute (
	name As String
)
```
```cpp
public:
void UnsetAttribute(
	String^ name
)
```
```fsharp
member UnsetAttribute :
        name : string -> unit
```

#### Parameters

name String
     The attribute name.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

IFCAnyHandle Class

Autodesk.Revit.DB.IFC Namespace